
const weatherConfig = {
    '00': '晴',
    '01': '多云',
    '02': '阴',
    '03': '阴',
    '04': '阴',
    '05': '阴',
    '06': '雨夹雪',
    '07': '小雨',
    '08': '中雨',
    '09': '大雨',
    '14': '小雪',
    '15': '中雪',
    '16': '大雪',
    '18': '雾',
    '53': '霾',
    '54': '中度霾',
    '55': '重度霾',
}
const windCode = {
    '0': '微风',
    '1': '东北风',
    '2': '东风',
    '3': '东南风',
    '4': '南风',
    '5': '西南风',
    '6': '西风',
    '7': '西北风',
    '8': '北风',
}
const skyLine = {
    day: {
        d1: {
            colors: ['#86c3ca', '#b5e9e8']
        },
        d2: {
            colors: ['#43697f', '#abd2d7']
        },
        d3: {
            colors: ['#67a1dc', '#a8e0f7']
        },
        d4: {
            colors: ['#9b9b96', '#c1c1bc']
        },
        d5: {
            colors: ['#c09461', '#eedfa1']
        },
        d6: {
            colors: ['#50ade8', '#7ae0fa']
        },
        d7: {
            colors: ['#81aedc', '#a9def1']
        }
    },
    deg: -90
}
export { weatherConfig, windCode, skyLine };